// config.js
export const TAG_CONFIG = {
    "非编码存储科技": {
        "全物品单片": ["8箱单片", "10箱单片", "其他单片"],
        "大宗仓库": ["分类打包大宗", "盒分大宗", "四边形大宗"],
        "不可堆叠相关": ["不可堆叠分离", "不可堆叠分类"],
        "多物品相关": ["多物品分类 (MIS)", "多种类潜影盒分类 (MBS)"]
    },
    "潜影盒处理": {
        "潜影盒打包机": ["分类打包", "混杂打包", "自适应打包", "精密打包", "缓存打包", "可访问打包", "比例打包", "堆分打包"],
        "潜影盒拆包机": ["漏斗拆包", "矿车拆包 (Yeeter)", "烧包机"],
        "潜影盒展示": ["无残留展示", "自出盒展示", "常用物品展示", "可反悔展示", "上行展示", "精密展示", "细雪展示", "灵魂沙展示", "堆肥桶展示"],
        "潜影盒分类相关": ["潜影盒分类", "自适应潜影盒分类 (SVAR)", "车头及拐弯设计 (Keygen & U-turn)"],
        "分盒器相关": ["潜影盒分盒器", "理想分盒器 (矿车)"],
        "合并器相关": ["潜影盒合并器", "不满盒临时存储", "分组器 (Grouper)", "配对优化器"],
        "潜影盒填充度分类": [],
        "空盒仓库": []
    },
    "编码存储科技": {
        "编码全物品单片": ["常规编码单片", "矩阵编码单片", "高速编码单片", "其他编码单片"],
        "编码大宗仓库": ["编码大宗", "编码四边形大宗", "远程大宗"],
        "逻辑/传输": ["逻辑电路", "移位寄存器", "转码器"],
        "编码器": ["二进制", "其他编码器"],
        "解码器": ["二进制", "十进制", "十六进制", "强模 (HSS/OSS)", "水道速", "方块事件深度(BED)"],
        "其他组件": []
    },
    "其他杂物": {
        "仓库成品": ["全物品仓库", "多物品仓库", "编码全物品"],
        "进阶组件": ["潜影盒UI", "潜影盒硬盘", "动态大宗"],
        "整流器": ["盒流整流器", "堆分整流器", "矿车整流器"],
        "分流器/黑白名单": [],
        "堆分离/分类": [],
        "无实体输入": [],
        "水道相关": [],
        "地狱门加载器": []
    },
    "生产/合成": ["合成站", "合成器相关"],
    "版本": ["1.21.x", "1.20.x", "1.19+", "1.17+", "1.16+"],
};

export const CATEGORIES = Object.keys(TAG_CONFIG);
